import json
import os
import random


import firebase_admin

from firebase_admin import db, credentials


"""
Gaming
"""

active_games = {}

"""
Env Variables и прочие вещи (базы данных)
"""

WELCOME_MESSAGE_EN = "Hello! it looks like ur trying to install dimabot on your server (or someone is trying to), however, itz not working properly yet vro... owner or any admin should probably configure bot's settings with a command `/settings`\ncheers!"
FEEDBACK_CHANNEL_ID = os.environ['FEEDBACK_CHANNEL_ID'] # ID канала с обратной связью.
PREFIX = '!'

service_account_json = os.getenv("FIREBASE_SERVICE_ACCOUNT_JSON")
service_account_dict = json.loads(service_account_json)
cred = credentials.Certificate(service_account_dict)
firebase_admin.initialize_app(cred, {
      'databaseURL': f'{os.getenv("LINK_DATABASE")}'
  })

nights_ref = db.reference('nights')
economy_ref = db.reference('economy')
inventory_ref = db.reference('inventory')
penalty_ref = db.reference('penalty')
servers_ref = db.reference('servers')

cool_dict = {}

'''
Секция со словарём предметов
Формат: Множитель, слово, название предмета, описание предмета, функция использования, эмодзи предмета, стандартная цена в магазине;
'''

items = {
            '👢': [1, "монет", "грязный ботинок", "Грязные ботинки штамповали тысячами в Австралии. Неизвестно почему, но все они оказались в море. Спасите морской биоценоз — соберите их все!", "id0use", '👢', "6"],
            '🐟': [1.1, "см", "карась","Карась является самым частовречающимся представителем в здешних водах. Скажите ему привет!", None, '🐟', "51"],
            '🐠': [1.45, "см", "брат карася","Брат Карася не знает, что у него есть брат. Похоже, тот отбился от косяка... Какая досада!", None, '🐠', "62"],
            '🐡': [1.28, "см", "рыба агу ага","Это удивительная рыба Агу Ага, о ней мало что известно человечеству.", None, '🐡', "73"],
            '🪼': [1.76, "см", "медуза крутая","Нередко медузы считаются крутыми, поскольку технически бессмертны (кроме того видоса про черепаху)", None, '🪼', "83"],
            '🦐': [1.2, "см", "креветочка","Эта креветочка такая милая :)", None, '🦐', "56"],
            '🐙': [2.3, "см", "разрушитель три тысячи","Ну, не такой уж и страшный.", None, '🐙', "290"],
            '🦈': [3.23, "см", "Я АКУЛА","ААААААААААА ЛАДНО", None, '🦈', "430"],
            '🐚': [1.21, "монет", "плавающая ракушка","Говорят, что через такие можно услышать море. Хотя, мы итак рядом с морем, чтобы его слушать.", None, '🐚', "48"],
            '🍌': [1, "монет", "банано","Кто-то небрежно очистил банан от кожуры. Интересно, их действительно собирают с пальм?", None, '🍌', "25"],
            '🤖': [5.1, "монет", "петя умный","Петя версия v1. Ничего не делает. Зато круто выглядит.", None, '🤖', "20000"],
            '💩': [1, "монет", "мусор (говно)","Ну и что за хрень...", None, '💩', "2"],
            '🎩': [2.45, "монет", "шляпникус","Я не знаю, что это, но это точно не из нашего мира. Может быть, оно обладает каким-либо функционалом? Или используется для чего-то? Кто знает...", "Перемещает вас в рандомную локацию или даёт рандомный статусный эффект", '🎩', "872"],
            '🧦': [1.05, "монет", "грязные носки (братья грязного ботинка)","Грязные носки не штамповали тысячами, однако, эти раритетные экземпляры никто не хочет покупать. Ну, кроме вас, если вы сюда нажали, увы.", "func", '🧦', "98"],
            '🎣': [2, "монет", "удочка TIER 2","Теперь вы сможете рыбачить не руками с леской и крючком, а с удочкой и леской с крючком!", None, '🎣', "1575"],
            '♟️': [6, "монет", "пешка", f"Checkmate in {str(random.randint(2, 600))} moves", None, '♟️', "2009"],
            '🏵️': [1.5, "монет","цветок муосотис", "Прекрасный подарок на любое событие в жизни человека.", None, '🏵️', "367"],
            '🚘': [3.45, "монет", "собственная тачка","Check out my new гелик!", None, '🚘', "16650"],
            '🔩': [0.23, "монет", "металлолом декеинг","Очень распространённый материал чтобы использовать его для создания разных штук...", None, '🔩', "250"],
            '📟': [2.3, "монет", "пейджер","Прямиком из 1980-го года (ну это у нас).", None, '📟', "487"],
            '🖲️': [2.1, "монет", "красная кнопка", "У-у-у, прямо таки хочется нажать!", None, '🖲️', "129"],
            '💰': [1, "монет", "мешок с деньгами", "Я посчитал и на это надо гриндить целых 167 часов! Ну, ладно, это если бы шансы рыбы были такими же, но теперь они изменились!", None, '💰', "5000000"],
            '🧬': [5.3, "монет", "ДНК", "Каким образом это вообще продаётся? Похоже, мы живём в будущем! Я сам определяю свой геном...", None, '🧬', "999"],
            '🪚': [1.6, "монет", "пилище", "Я бы с такой не играл.", None, '🪚', "339"],
            '🚪': [1.28, "монет", "дверь", "Дверь мне запили!", None, '🚪', "199"],
            '🍣': [1.28, "монет", "сашими", "DIY, прямиком из-под ножа!", None, '🍣', "155"],
            '⛵': [1.12, "монет", "лодка", "преследуешь мечты которые дрим и sail или просто ты лоцман - прямой путь в японию", "id26use", '⛵', '2500']
        }

crafting_dict = {
            frozenset(['🪚', '🚪', '🔩']): items.get('🎣'),
            frozenset(['🧬', '📟', '🖲️']): items.get('🤖'),
            frozenset(['🎩', '📟', '🖲️']): items.get('🚘'),
            frozenset(['🍌', '♟️', '💩']): items.get('🎩'),
            frozenset(['🐟', '🐠', '🐡']): items.get('🍣'),
            frozenset(['🐟', '🪼', '🐡']): items.get('🍣'),
            frozenset(['🐠', '🪼', '🐡']): items.get('🍣'),
            frozenset(['🐠', '🪼', '🐟']): items.get('🍣'),
            frozenset(['🐟', '🐡']): items.get('🍣'),
            frozenset(['🪼', '🐡']): items.get('🍣'),
            frozenset(['🪼', '🐟']): items.get('🍣'),
            frozenset(['🪼', '🐠']): items.get('🍣'),
            frozenset(['🐡', '🐠']): items.get('🍣'),
            frozenset(['🐟', '🐠']): items.get('🍣'),
            frozenset(['🪚', '🚪', '🚪']): items.get('⛵')

        }
all_items = {
    '👢': {
        "multiplier_price": eval("round((random.random() + 1))"),
        "word": {'LANG_RU': "монет", "LANG_EN": "coins"},
        "description": {'LANG_RU': "Грязные ботинки штамповали тысячами в Австралии. Неизвестно почему, но все они оказались в море. Спасите морской биоценоз — соберите их все!", "LANG_EN": "placeholder"},
        "usage": "id0use",
        "shop_price": eval("round((random.random() + random.randint(6, 25)))")
    }
}


'''
Секция с картами для рыбалки
Формат: Карта, описание, кол-во рыб, координаты hook, координаты лодки, шанс на сокровище, случайные события;
'''

maps = {
    "спокойный океан": [[["◼️", "◼️", "◼️", "◼️", "◼️", "☀️", "◼️"],
                         ["◼️", "◼️", "◼️", "◼️", "◼️", "◼️", "◼️"],
                         ["◼️", "◼️", "◼️", "🛶", "◼️", "◼️", "◼️"],
                         ["🟦", "🟦", "🟦", "🟦", "🟦", "🟦", "🟦"],
                         ["🟦", "🟦", "🟦", "🪝", "🟦", "🟦", "🟦"],
                         ["🟦", "🟦", "🟦", "🟦", "🟦", "🟦", "🟦"],
                         ["🟦", "🟦", "🟦", "🟦", "🟦", "🟦", "🟦"],
                         ["🟦", "🟦", "🟦", "🟦", "🟦", "🟦", "🟦"],
                         ["🟦", "🟦", "🟦", "🟦", "🟦", "🟦", "🟦"],
                         ["🟦", "🟦", "🟦", "🟦", "🟦", "🪸", "🟦"],
                         ["🟨", "🪸", "🟦", "🟦", "🟨", "🟨", "🟨"],
                         ["🟨", "🟨", "🟨", "🟨", "🟨", "🟨", "🟨"]],
                        "Кажется, что именно здесь находятся все тайны этого мира",
                        3,
                        [4, 3],
                        [2, 3],
                        "placeholder",
                        "placeholder"],

    "попасити 2029 год": [[["🟥","🌫","🌫️","🌫","🟥","🟥","🟥","🟥","🟥"],
                  ["🟧","🟧","🟧","🟧","🟧","🟧","🌫","🌫️","🟧"],
                  ["🌆","🌇","🌆","🟧","🛶","🟧","🟧","🟧","🌆"],
                  ["🟦","🟦","🟦","🟦","🟦","🟦","🟦","🟦","🟦"],
                  ["🟦","🟦","🟦","🟦","🪝","🟦","🟦","🟦","🟦"],
                  ["🟦","🟦","🟦","🟦","🟦","🟦","🟦","🟦","🟦"],
                  ["🟦","🟦","🟦","🟦","🟦","🟦","🟦","🟦","🟦"],
                  ["🟦","🟦","🟦","🟦","🟦","🟦","🟦","🟦","🟦"],
                  ["🟦","🟦","🟦","🟦","🟦","🟦","🟦","🟦","🟦"],
                  ["🟦","🟫","🟦","🪸","🟦","🟦","🟦","🟦","🟫"],
                  ["🟫","🟫","🟫","🟫","🟦","🟦","⚙️","🟫","🟫"],
                  ["🟫","🟫","🟫","🟫","🟫","🟫","🟫","🟫","🟫"]],
                 "Этот индустриальный город развился до таких масштабов, потому что там не было... сами знаете кого",
                 4,
                 [4, 4],
                 [2, 4],
                 "placeholder",
                 "placeholder"]
}

fish_available = {
    'спокойный океан': [['🐟', '🐟', '🐟', '🐟', '🐟', '🐠', '🐠', '🐠', '🐡', '🪼', '👢'],
                        ['🐟', '🐟', '🐟', '🐟', '🐟', '🐠', '🐠', '🐠', '🐡', '🪼', '👢', '🦐', '🦐', '🐙', '🦈', '🐚',
                         '🐚']],
    'попасити 2029 год': [['🚪'] * 30 + ['🔩'] * 20 + ['📟'] + ['🖲️'] + ['💩'] * 5 + ['👢'] * 5,
                          ['🚪'] * 20 + ['🔩'] * 15 + ['📟'] * 3 + ['🖲️'] * 2 + ['💩'] * 1 + ['👢'] * 1]
}

fish_book = {
                        '🐟': ["вы поймали карася размером {} сантиметров", 1, "fish"],
                        '🐠': ['вы поймали брата карася размером {} сантиметров', 1, "fish"],
                        '🐡': ['вы поймали рыбу агу ага размером {} сантиметров', 1, "fish"],
                        '🪼': ['вы поймали медузу крутую размером {} сантиметров', 1, "fish"],
                        '🦐': ['вы поймали креветочку размером {} сантиметров', 1, "fish"],
                        '🦈': ['Трепещи, rer_5111, я поймать АКУЛУ размером {} сантиметров!', 1, "fish"],
                        '👢': ['вы поймали грязный ботинок из австралии.', random.randint(1, 10), "item"],
                        '🐚': ['вы поймали плавающую ракушку.', random.randint(10, 30), "item"],
                        '🚪': ['вы поймали Д.В.Е.Р.Ь.', random.randint(10, 300), "item"],
                        '🔩': ["вы поймали болт фром тхандер (на самом деле металлолом...)", random.randint(1, 100),
                              "item"],
                        '📟': ["вы поймали что это нахер", random.randint(100, 500), "item"],
                        '🖲️': ["вы поймали жми на кнопку, кронк", random.randint(50, 200), "item"],
                        '💩': ["фу чё это так воняет, убери этот навоз", 1, "item"]

                    }



